app/views/book/show_subjects.html.erb

SELECT `books`.* FROM `books` WHERE `books`.`subject_id` = 3
---
<ul>
   <% @subject.books.each do |c| %>