app/controllers/book_controller.rb

SELECT `subjects`.* FROM `subjects`
---
   def new
      @book = Book.new
      @subjects = Subject.all

INSERT INTO `books` (`title`, `price`, `subject_id`, `description`, `created_at`) VALUES ('B1', 890.0, 1, 'Phhjs', '2022-04-04 16:57:14')
SELECT `subjects`.* FROM `subjects`
---
   def create
     #building a book instance variable with parameters passed
      @book = Book.new(book_params)

      if @book.create_book #calling create method in the model
        flash[:alert] = "Book added successfully!"
        redirect_to book_index_path
      else
        flash[:alert] = "Couldn't add book!"
        @subjects = Subject.all

SELECT `subjects`.* FROM `subjects`
---
   def edit
      @book = Book.find_book(params[:id])
      @subjects = Subject.all

UPDATE `books` SET `books`.`description` = 'Cheems' WHERE `books`.`id` = 2
---
   def update

      book_id = params[:id]

      if Book.update_book(book_id,book_param)

DELETE FROM `books` WHERE `books`.`id` = 27
---
   def destroy

      if Book.delete_book(params[:id])

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
   def show_subjects
      @subject = Subject.find(params[:id])