app/models/book.rb

    def create_book
        return 1 if self.save #inserting the record in db table
---
INSERT INTO `books` (`title`, `price`, `subject_id`, `description`, `created_at`) VALUES ('B4', 890.0, 3, 'm', '2022-04-07 09:21:44')

    def self.find_book(book_id)
        Book.find(book_id)
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

    def self.update_book(book_id,book_param)

        @book = Book.find(book_id)

        return 1 if @book.update(book_param)
---
UPDATE `books` SET `books`.`description` = 'mdf' WHERE `books`.`id` = 27
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `books`.`description` = 'Desc of book1' WHERE `books`.`id` = 1

    def self.delete_book(book_id)
        return 1 if Book.find(book_id).destroy
---
DELETE FROM `books` WHERE `books`.`id` = 31
DELETE FROM `books` WHERE `books`.`id` = 40
SELECT `books`.* FROM `books` WHERE `books`.`id` = 40 LIMIT 1